[
    {
        "id": "how_to_play_media_on_all_homepods_via_airplay_and",
        "title": "How to play media on all HomePods via AirPlay and adjust volume individually using Shortcuts?",
        "url": "https://www.reddit.com/r/shortcuts/comments/1kq7yqd/how_to_play_media_on_all_homepods_via_airplay_and/",
        "author": "",
        "subreddit": "",
        "created_utc": 0,
        "description": "I want to create an Apple Shortcut on my iPhone or iPad that plays a given media (song, playlist, podcast, etc.) on every AirPlay device in my home — specifically all my HomePods. Additionally, I want to I want to adjust the volume individually for each HomePod so they sound balanced while I am walking around my apartment and so that I dont hear for example my living room HomePod from the bedroom and vice versa. Is this possible with Shortcuts?\n\nWhat I found so far: \n\n*  AirPlay 2 supports multi-room audio, so you can play the same audio on multiple AirPlay 2 devices at once. However, the Shortcuts app doesn’t let you select multiple AirPlay devices individually for playback. Instead, it only allows selecting a group of speakers if you’ve grouped them in the Home app.\n* Shortcuts can set the volume of the currently playing device or group, but it cannot set volume individually for each device within a group. Volume control per device is only possible manually in the Home app or via Siri voice commands. (Is that still true or am I mistaken?)\n* You could use scenes created in the Home App as a workaround but that only lets you adjust the volume for all HomePods targeted at once\n\nCan you guys help me?",
        "comments": 0,
        "analysis": "The user wants to create an Apple Shortcut that plays a specified media track simultaneously on all their HomePods via AirPlay. Additionally, they want to individually adjust the volume level for each HomePod through the Shortcut, so the sound is balanced in different rooms of their home. Their challenge is that while AirPlay 2 supports multi-room audio playback and Shortcuts can control playback on speaker groups, Shortcuts currently do not allow selecting multiple AirPlay devices individually or adjusting each device’s volume separately within a group. The user is seeking a way to accomplish these tasks—multi-device playback with per-device volume control—using the Shortcuts app or any other feasible method.",
        "analysis_timestamp": "2025-05-19T23:03:11Z"
    },
    {
        "id": "is_there_any_way_to_get_whats_a_certain_distance",
        "title": "Is there any way to get what’s a certain distance in one direction using shortcuts?",
        "url": "https://www.reddit.com/r/shortcuts/comments/1kqcz7t/is_there_any_way_to_get_whats_a_certain_distance/",
        "author": "",
        "subreddit": "",
        "created_utc": 0,
        "description": "I'm making a shortcut and need a way to get what's a mile north of my current location or what's 2 miles south etc",
        "comments": 0,
        "analysis": "The user is trying to find a way within Apple Shortcuts to calculate or determine a specific geographic location that is a certain distance in a particular direction (e.g., one mile north or two miles south) from their current location.",
        "analysis_timestamp": "2025-05-19T23:03:13Z"
    },
    {
        "id": "shortcut_to_change_screen_auto_lock_to_never",
        "title": "Shortcut to change screen auto lock to \"never\"?",
        "url": "https://www.reddit.com/r/shortcuts/comments/1kqo30u/shortcut_to_change_screen_auto_lock_to_never/",
        "author": "",
        "subreddit": "",
        "created_utc": 0,
        "description": "I often have my screen on when cooking and need safari to stay open and on. When I'm using my phone regularly, I'd like to keep the 30 second default lockout time. Is there a shortcut to use to set it to never so I don't have to keep going in to settings to manually adjust? Thanks in advance! ",
        "comments": 0,
        "analysis": "The user wants to create an Apple Shortcut that can automatically change the screen auto-lock setting to \"Never\" while they are using their phone for activities like cooking, to keep the screen on without manually adjusting settings each time. They also want the screen to revert back to the default 30-second auto-lock when done.",
        "analysis_timestamp": "2025-05-19T23:03:15Z"
    },
    {
        "id": "share_sheet_shortcut_how_to_tldr_copy_current",
        "title": "Share Sheet Shortcut How to?  TLDR; Copy Current Webpage URL, Open Parsely.us, and Auto-Paste Link in First Textbox (With Action Button trigger).",
        "url": "https://www.reddit.com/r/shortcuts/comments/1kqmh92/share_sheet_shortcut_how_to_tldr_copy_current/",
        "author": "",
        "subreddit": "",
        "created_utc": 0,
        "description": "i wanna make an ios shortcut where when its triggerred from the share sheet in the browser it copies the link of the current webbpage and opens [https://parsely.us](https://parsely.us) and then pastes the link in the 1st textbox. now that i have a new phone with an action button i wanna try this out aha.",
        "comments": 0,
        "analysis": "The user wants to create an iOS Shortcut that, when triggered from the browser's share sheet, will copy the current webpage URL, open the website parsely.us, and automatically paste the copied link into the first textbox on that site. They also want to activate this shortcut using their phone's new action button.",
        "analysis_timestamp": "2025-05-19T23:03:17Z"
    }
]