[
  {
    "id": "1km8e0r",
    "title": "In case you want to get rid of your addiction...",
    "url": "https://www.reddit.com/r/shortcuts/comments/1km8e0r/in_case_you_want_to_get_rid_of_your_addiction/",
    "author": "e4sy_143",
    "subreddit": "shortcuts",
    "created_utc": 1747204088.0,
    "description": "Hello, my fellow addicts!\n\nI have the unhealthy habit of smoking cigarettes and have been trying to quit for some time now. \nTo visualize my progress and motivate myself, I've built this 'Sober Since...' Shortcut that shows how long I've been quitting.\n\n⭐️Features:\n- The Shortcut has two different access modes. The first is achieved by starting the Shortcut from the Shortcut App and the other mode is achieved by starting the Shortcut outside of the Shortcut App.\n- For a quick overview, the Shortcut label is updated every time you start it outside the Shortcuts App or have it updated by an Automation (best run shortly after the time of the beginning of your quitting).\n- You can place and launch the Shortcut as a widget on the home screen or in the control center to get a more detailed view of its progress.\n- Light/- and Darkmode support.\n- It is possible to restart the timer if you have a fallback (the number of attempts is counted up automatically).\n- The timestamps are encoded so that you cannot cheat yourself or others that easily ;)\n- The Shortcut works completely offline and no data ever leaves your device.\n\n⚙️Installation:\n- To use the Shortcut, you need the App DataJar (https://apps.apple.com/de/app/data-jar/id1453273600) to be able to save values permanently.\n- You need to start the Shortcut from the Shortcut App to perform the initial installation.\n- This way you can also access a menu later to edit your entries if necessary.\n\n🔗Shortcuts: \n- Shortcut: https://www.icloud.com/shortcuts/238012c12a8140a4a523db3dab06fcd8 \n- Shortcut for Automation: https://www.icloud.com/shortcuts/8ff2f00e89bc470dbd9a9f7f2021b70c\n\nIf you have any questions, problems or ideas on how to improve the Shortcut, please let me know.\n\nOtherwise, I wish everyone the best of luck to successfully and permanently overcome their addictions and hope that my little Shortcut might help you a little with that :) \nIf you can imagine it, then you can do it!",
    "comments": 60,
    "analysis": "The user created an Apple Shortcut called 'Sober Since...' to help visualize and track progress in quitting smoking, providing features like widget support, automation, and offline functionality. They are sharing the shortcut along with installation instructions and links, and inviting feedback or improvement ideas.",
    "sentiment": "sharing",
    "analysis_timestamp": "2025-05-19T20:14:33-0400"
  },
  {
    "id": "1kmtl5v",
    "title": "Apple Pay Success Sound effect",
    "url": "https://www.reddit.com/r/shortcuts/comments/1kmtl5v/apple_pay_success_sound_effect/",
    "author": "PODDAAA",
    "subreddit": "shortcuts",
    "created_utc": 1747264815.0,
    "description": "Here’s a simple button to play the “Apple Pay Success” sound effect. Just for pranking your friends like tapping their phone with yours and run the shortcut. A bit useless but funny :)\n\nDownload: https://www.icloud.com/shortcuts/1b49d15cc47d4fa893de01cbcc061c82",
    "comments": 23,
    "analysis": "The user is sharing a simple Apple Shortcut that plays the 'Apple Pay Success' sound effect, intended for pranking friends.",
    "sentiment": "sharing",
    "analysis_timestamp": "2025-05-19T20:14:35-0400"
  },
  {
    "id": "1kmb8b5",
    "title": "What’s the smallest AI shortcut that saved you the most time?",
    "url": "https://www.reddit.com/r/shortcuts/comments/1kmb8b5/whats_the_smallest_ai_shortcut_that_saved_you_the/",
    "author": "prakritiad",
    "subreddit": "shortcuts",
    "created_utc": 1747216352.0,
    "description": "Not some big automation setup. Just a tiny thing that took 2 mins but now you use it constantly.  \nFor me it was a GPT that turns bullet points into full emails.  \nWould love to steal ideas—what’s yours?",
    "comments": 68,
    "analysis": "The user is seeking small, simple AI-based Apple Shortcuts that save time, specifically asking the community to share quick and efficient shortcuts they find useful.",
    "sentiment": "need help",
    "analysis_timestamp": "2025-05-19T20:14:36-0400"
  },
  {
    "id": "1ko73v1",
    "title": "Can I get my automation to run without clicking continue?",
    "url": "https://www.reddit.com/r/shortcuts/comments/1ko73v1/can_i_get_my_automation_to_run_without_clicking/",
    "author": "3thotsandacot",
    "subreddit": "shortcuts",
    "created_utc": 1747417613.0,
    "description": "When the if statement is not true the music will start fine. If it is true it ask to continue and then when clicking continue it runs successfully and then says operation took too long.",
    "comments": 12,
    "analysis": "The user is trying to figure out if their Apple Shortcut automation can run fully automatically without requiring them to click 'continue' when an if statement is true.",
    "sentiment": "need help",
    "analysis_timestamp": "2025-05-19T20:14:38-0400"
  },
  {
    "id": "1klv2oc",
    "title": "I’ve made a shortcut to see at your homescreen your today’s steps and how often you reach 10k in this month.",
    "url": "https://www.reddit.com/r/shortcuts/comments/1klv2oc/ive_made_a_shortcut_to_see_at_your_homescreen/",
    "author": "Incubuser",
    "subreddit": "shortcuts",
    "created_utc": 1747164731.0,
    "description": "Just add the single widget from shortcut to your homescreen. Then edit and choose this shortcut and tap on it. \n\nhttps://www.icloud.com/shortcuts/8e29a9ec0e9443af8438601ce8ae2c6a",
    "comments": 5,
    "analysis": "The user is sharing a shortcut they created that displays the user's daily steps and the frequency of reaching 10,000 steps this month on the home screen widget.",
    "sentiment": "sharing",
    "analysis_timestamp": "2025-05-19T20:14:39-0400"
  },
  {
    "id": "1knrbuf",
    "title": "Captain’s Log - Can I have the ‘Remember This’ shortcut run by saying out loud  “Captain’s Log”?",
    "url": "https://www.reddit.com/r/shortcuts/comments/1knrbuf/captains_log_can_i_have_the_remember_this/",
    "author": "CraigHChrist",
    "subreddit": "shortcuts",
    "created_utc": 1747366644.0,
    "description": "Maybe an automation? It’s hard to test because I’m trying to surprise my wife. TIA",
    "comments": 17,
    "analysis": "The user wants to know if they can run the 'Remember This' shortcut by saying 'Captain’s Log' out loud, possibly through an automation, and is seeking advice on how to do this.",
    "sentiment": "need help",
    "analysis_timestamp": "2025-05-19T20:14:41-0400"
  },
  {
    "id": "1km0wqc",
    "title": "[Updated] Nutra 2.0 - A food logger/macro tracker ~700 actions",
    "url": "https://www.reddit.com/r/shortcuts/comments/1km0wqc/updated_nutra_20_a_food_loggermacro_tracker_700/",
    "author": "MatchingColors",
    "subreddit": "shortcuts",
    "created_utc": 1747179436.0,
    "description": "I recently updated my food tracking shortcut! I decided to lean into the vCard design and while it was tricky to get right, I think it ended up in a good place. Turns out, if the icon you use has a thin circle border, the background becomes transparent and not white. I think this really helps the look.\n\nhttps://www.icloud.com/shortcuts/67cbb685f34a45ecbcda598ca6fe457c\n\nOn to the changes:\n\n1. [NEW] Added the ability to scan barcodes and retrieve nutrition values from Nutritionix API.\n2. [NEW] Added the ability to list whole ingredients (that is, unbranded things) and aggregate nutrition values from Nutritionix API.\n3. [NEW] Overhauled UI. Moved limits and custom items to ‘My Stuff’. Redesigned settings menu with proper checkbox experience. Can hide any external service features. Also includes new icons (that change with dark mode), tooltips, proper menu navigation, and enhanced entry layout.\n4. [UPDATED] Improved ChatGPT estimation prompt for more consistent output.\n5. [UPDATED] Improved check for updates function that now compares version automatically and tells you if there is an update. This function still needs to be manually run from the Settings menu.\n6. [UPDATED] Improved image parsing.\n7. [FIXED] Initial help dialog\n8. [REMOVED] ‘Add by image’ menu option. You can still share images to Nutra to utilize the image parsing ability.",
    "comments": 7,
    "analysis": "The user is sharing an update to their food logging and macro tracking Apple Shortcut, Nutra 2.0, highlighting new features, UI improvements, fixed bugs, and removed options.",
    "sentiment": "sharing",
    "analysis_timestamp": "2025-05-19T20:14:42-0400"
  },
  {
    "id": "1ko40wz",
    "title": "Sharing an automatic expense tracker for India",
    "url": "https://www.reddit.com/r/shortcuts/comments/1ko40wz/sharing_an_automatic_expense_tracker_for_india/",
    "author": "bokbokwhoosh",
    "subreddit": "shortcuts",
    "created_utc": 1747410069.0,
    "description": "Hello all,\n\nI created an automatic expense tracker for iOS/Mac in India using Shortcuts and Automations. It's a bit clumsy, but it works. Made it because I couldn't find any reliable apps that will automatically track spending in India. Made it for myself, thought I'd share. It's a first attempt, do let me know if it works for you. All credit to ChatGPT for making the regex for parsing SMSes.\n\n* Uses transaction SMSes to add spends to a Notes file.\n* Uses Automations to forward SMSes using some keywords to the Shortcut.\n* The Shortcut parses the message and adds it to the Notes file.\n* Follows a CSV format so that you can later export it to a spreadsheet application to analyse if you'd like. Format is: *date, expense amount, account/card, merchant/recipient, month*. The final 'month' entry is to make things easier with a spreadsheet (eg. using charts or a pivot table to understand expenses better).\n* Each time it tracks an expenditure, it will show a notification showing what it tracked. This can be disabled by deleting that block in the Shortcuts app.\n* **Currently works for:**\n   * *Credit cards*: HDFC, ICICI, Axis, IndusInd, IDFC\n   * *Accounts/UPI*: SBI, HDFC, IndusInd, IDFC\n\n**Pros:**\n\n* Privacy-preserving. All data stays safely encrypted on your device (and iCloud if enabled). No communication with any third-party app or website.\n* Automatic. Tracks SMSes and adds spends automatically. Even if it stops tracking/cannot track merchant name, it will still track amount, date, and which card/account was used.\n* Entirely native. Uses Shortcuts and Notes app present natively on Apple devices. No extra apps to install.\n* Easily analysable. Since it saves in CSV, you can export the Notes file to a spreadsheet to understand your expenses. You can keep it as simple as summing up columns to as fancy as using pivot tables. For eg. [see this tutorial](http://Hello all,   I created an automatic expense tracker for iOS/Mac using the native Shortcuts app. It%27s a bit clumsy, but it works. Made it because I couldn%27t find any reliable apps that will automatically track spending in India.      Uses transaction SMSes to add spends to a Notes file.     Uses Automations to forward SMSes using some keywords to the Shortcut.     The Shortcut parses the message and adds it to the Notes file.     Follows a CSV format so that you can later export it to a spreadsheet application to analyse if you%27d like. Format is: date, expense amount, account/card, merchant/recipient, month. The final %27month%27 entry is to make things easier with a spreadsheet (eg. using charts or a pivot table to understand expenses better).     Each time it tracks an expenditure, it will show a notification showing what it tracked. This can be disabled by deleting that block in the Shortcuts app.\n\n**Cons:**\n\n* While it *might* work for other banks and cards, it currently works only for the banks and cards given above. Not tested on debit cards. If it works for other banks/cards, it will most probably only extract the date, account/card, and amount spend, and *not* the merchant name.**\\***\n* Often, it may not extract the merchant name, just extracts the date, expense amount, account/card, and month.\n* It is based on how transaction SMSes look right now. If that format changes, this will not work. But again, it will most probably extract everything except the merchant name.\n* I'm not a coder, it's rather clumsy right now. It uses multiple nested if-then statements to rule out the kind of bank/card (mostly to identify the merchant). It may not be practical to include every single UPI and card-issuing bank.\n* Might require some manual interventions when the merchant is not tracked or not clear. The notification should alert you to what has been automatically tracked.\n* *Does not* track income, money sent to you, refunds etc. Only tracks expenses.\n* This not a budgeting solution, only an expense tracker. That said, feel free to use it to create your own Shortcuts or spreadsheet to do more advanced budgetting.\n\n**Instructions:**\n\n1. Create a note in the native Notes app titled \"Expense tracker\" before you import the file. First line of the notes file should be: *Date, Amount, From, To, Month*\n2. Import the Shortcut using the icloud link below.\n3. Go through the Shortcut to make sure that it is linked to the Notes file. If it appears in red, click on it, and link it to your note file.\n4. (Please go through the Shortcut if you can to ensure you understand how it works, even if you don't understand the regex.)\n5. Set up 2 Automations on the Shortcuts app (use the *Automation* tab):\n   1. When: Message &gt; Leave sender blank | add Message Contains: *spent* | Select Run Immediately &gt; My Shortcuts &gt; select *Expense tracker*\n   2. When: Message &gt; Leave sender blank | add Message Contains: *debited* | Select Run Immediately &gt; My Shortcuts &gt; select *Expense tracker* [*This is what is should look like*](https://i.postimg.cc/3rm6LNgZ/automations-eg.jpg)\n6. You should be ready to go! Check to see if you get a notification when you spend something the next time saying \"Tracked...\". If not, please report here and send a copy of the transaction message (without personal details)?\n\n**You can find and import the Shortcut here:** [**https://www.icloud.com/shortcuts/b1667c3d112046fba155f9101c5b7759**](https://www.icloud.com/shortcuts/b1667c3d112046fba155f9101c5b7759)\n\n*(v. 1.0 | last updated 16 May, 2025)*\n\n**Looking ahead:**\n\n* I plan to keep this updated as transaction SMS formats change and as I crowdsource other formats.\n* ** If you send me** (DM or paste here) your transaction SMSes from other cards/banks, I will try to add them to this Shortcut. Needless to say, please randomise your account/card number, amount, and date, but try to keep the merchant as-is if you are okay with it.\n\n-----------------\n\nThis is what the Notes file would look like:\n\n`28 Apr 25, 1000.50, Card XX1234, IND*Amazon, Apr`\n\n`28 Apr 25, 2000.00, A/c **5678, Unkown, May`\n\n*(first is a card transaction, second is a UPI transaction but could not track merchant)*",
    "comments": 1,
    "analysis": "The user has created and is sharing an automatic expense tracker Shortcut for iOS/Mac tailored for Indian bank transaction SMSes. It automatically parses spending details from SMS messages into a Notes file in CSV format for easy expense tracking and analysis. The post provides detailed instructions, pros, cons, and a download link, and invites feedback for improvements and additional bank support.",
    "sentiment": "sharing",
    "analysis_timestamp": "2025-05-19T20:14:44-0400"
  },
  {
    "id": "1kngj1r",
    "title": "Multiple automations for one trigger, is it fine to have many different shortcuts by several instances of same trigger",
    "url": "https://www.reddit.com/r/shortcuts/comments/1kngj1r/multiple_automations_for_one_trigger_is_it_fine/",
    "author": "wiewior_",
    "subreddit": "shortcuts",
    "created_utc": 1747336073.0,
    "description": "Is it ok to have different shortcuts to do different things as separate instances of automation, or should I compress them into one shortcut that will do many more things?",
    "comments": 9,
    "analysis": "The user is asking whether it is acceptable to have multiple separate automations triggered by the same event in Apple Shortcuts, or if it is better to combine all actions into a single shortcut.",
    "sentiment": "need help",
    "analysis_timestamp": "2025-05-19T20:14:46-0400"
  },
  {
    "id": "1kohgvd",
    "title": "Speak using Deepgram TTS  –  200 Hours of Free Voice Output",
    "url": "https://www.reddit.com/r/shortcuts/comments/1kohgvd/speak_using_deepgram_tts_200_hours_of_free_voice/",
    "author": "DarthJave",
    "subreddit": "shortcuts",
    "created_utc": 1747445811.0,
    "description": "Hey folks, I’m excited to share my very first iOS Shortcut! It’s designed to convert any text into natural-sounding speech using Deepgram’s Text-to-Speech (TTS) API. Here’s what it does:\n\n* **Handles Text Input**: Paste/ input any block of text, access from the iOS share sheet or run as a shortcut within your shortcuts.\n* **Smart Processing(Deepgram TTS has a 2,000 character limit)**:\n   * If the text is **under 2,000 characters**, it sends the entire block to Deepgram and plays the audio.\n   * If it’s **over 2,000 characters**, it intelligently splits the text into paragraphs, sends each chunk separately to Deepgram, which adds a slight pause between chunks.\n\n\n\n**🎁 Bonus**: Deepgram offers **$200 in free credits** upon sign-up, with no credit card required. Given their pricing of **$0.03 per 1,000 characters**, this equates to approximately **6.6 million characters** or roughly **200 hours of voice output**  which is a substantial amount for free\n\n(I am in no way affiliated with Deepgram)\n\n**🔗 Shortcut Link**: [https://www.icloud.com/shortcuts/1f7244c546e54e6b9acc34c3f56d667a](https://www.icloud.com/shortcuts/1f7244c546e54e6b9acc34c3f56d667a)\n\n\n\n**🛠️ Requirements**:\n\n* A Deepgram API key (sign up [here](https://console.deepgram.com/signup?product=tts)).\n* Voice mode ID\n\nhttps://preview.redd.it/d7t4qtdpw81f1.png?width=560&amp;format=png&amp;auto=webp&amp;s=529ed9b99aaccab835162d60237f9afd69b1651d\n\n\n\n\n\nI’m still new to Shortcuts, so if you have suggestions or improvements, I’d love to hear them!",
    "comments": 2,
    "analysis": "The user is sharing their first iOS Shortcut that converts text to speech using Deepgram's TTS API, explaining its features, how it handles text input with character limits, and providing free credit information. They also invite feedback and suggestions for improvement.",
    "sentiment": "sharing",
    "analysis_timestamp": "2025-05-19T20:14:48-0400"
  },
  {
    "id": "1kn1yiu",
    "title": "Made a small tool to automate a boring repetitive task. Apparently, boring sells.",
    "url": "https://www.reddit.com/r/automation/comments/1kn1yiu/made_a_small_tool_to_automate_a_boring_repetitive/",
    "author": "Sansrules",
    "subreddit": "automation",
    "created_utc": 1747292753.0,
    "description": "I do a lot of client-facing work. I got tired of making the same folder structure every time a new project came in.\n\nClient onboards → create 30+ nested folders → share → repeat. Every. Single. Time.\n\nAt first, I thought I was just being lazy.  \nBut then I found a bunch of other people online ranting about the same thing.  \nThat’s when I realized, maybe this “boring” problem was actually worth solving.\n\nSo I built FolderGen, a tool to create folder templates with placeholders like \\[ClientName\\], \\[Date\\], \\[ProjectType\\] etc.  \nWith one click, it spins up a clean folder tree in your Google Drive.  \nNo Zapier. No scripts. No mess.\n\nAnd since Google Drive doesn’t let you duplicate folder structures natively, this makes the process *so* much easier.\n\nI just put it out there and to my surprise, I have started finding real traction.  \n  \nI know this isn’t world-changing AI or some massive workflow system but honestly, it's removed one of the most boring recurring tasks I deal with. Not trying to revolutionize the world. Just help people save time and stay organized.\n\nHappy to share how it works or answer questions!  \nAlways open to feedback from the community.",
    "comments": 97,
    "analysis": "The user created a tool called FolderGen to automate the repetitive task of creating complex nested folder structures for new client projects in Google Drive, addressing a common pain point of manual folder creation that Google Drive does not natively support.",
    "sentiment": "sharing",
    "analysis_timestamp": "2025-05-19T20:14:49-0400"
  },
  {
    "id": "1knbpvs",
    "title": "what's one thing you automated that saved you the most time?",
    "url": "https://www.reddit.com/r/automation/comments/1knbpvs/whats_one_thing_you_automated_that_saved_you_the/",
    "author": "Full-Foot1488",
    "subreddit": "automation",
    "created_utc": 1747324465.0,
    "description": "trying to get ideas and curious what’s actually working for folks.  \ncould be simple or complex and just wanna hear what made life easier for you.",
    "comments": 79,
    "analysis": "The user is seeking ideas and examples of effective time-saving automations using Apple Shortcuts from the community.",
    "sentiment": "need help",
    "analysis_timestamp": "2025-05-19T20:14:51-0400"
  },
  {
    "id": "1klvykk",
    "title": "Saw someone venting on Reddit, ended up building them peace of mind",
    "url": "https://www.reddit.com/r/automation/comments/1klvykk/saw_someone_venting_on_reddit_ended_up_building/",
    "author": "sabchahiye",
    "subreddit": "automation",
    "created_utc": 1747166865.0,
    "description": "\nThey ran a small but growing service business and mentioned it in a thread how much they hated writing weekly update emails.\n\nEvery Friday was the same routine: scroll through Slack, Jira, and Notion trying to piece together what happened, then write a summary and send it to the team.\nNobody liked doing it, so it kept getting pushed.\n\nI offered to help and built a quick flow in Make.\n\nIt pulls updates from all three tools, summarizes them, and sends out a clean, consistent weekly digest.\n\nAlso threw in some inbox triage, auto-label the junk, archive the noise, and flag the real stuff.\n\nTook maybe an hour. Now the updates just… show up. And their inbox? Way less chaotic.\n\nThey messaged me later saying it felt like “a weight lifted.”\nAll from a few simple modules.\n\nIt’s wild how small automations can create real peace of mind.\nGrateful for random Reddit connections and the internet in general :)",
    "comments": 27,
    "analysis": "The user is sharing a story about how they helped someone automate the tedious task of writing weekly update emails by creating a flow that pulls updates from Slack, Jira, and Notion, summarizes them, and sends a weekly digest, resulting in reduced workload and improved peace of mind.",
    "sentiment": "sharing",
    "analysis_timestamp": "2025-05-19T20:14:53-0400"
  },
  {
    "id": "1kq7rvw",
    "title": "What are your favorite AI first automation tools today?",
    "url": "https://www.reddit.com/r/automation/comments/1kq7rvw/what_are_your_favorite_ai_first_automation_tools/",
    "author": "Sure_Marsupial_4309",
    "subreddit": "automation",
    "created_utc": 1747648429.0,
    "description": "The world of AI automation agents is definitely fast moving and there are like 10 new ones launching daily. So curious, what are your favorite AI first automation tools today?",
    "comments": 30,
    "analysis": "```json\n{\n  \"analysis\": \"The user is asking the community to share their favorite AI-first automation tools, indicating interest in learning about popular or effective tools in the rapidly evolving AI automation space.\",\n  \"sentiment\": \"need help\"\n}\n```",
    "sentiment": "",
    "analysis_timestamp": "2025-05-19T20:14:54-0400"
  },
  {
    "id": "1klu14j",
    "title": "I've booked over 20 high-ticket meetings this month without sending a single manual email—my AI Lead Agent did it all.",
    "url": "https://www.reddit.com/r/automation/comments/1klu14j/ive_booked_over_20_highticket_meetings_this_month/",
    "author": "EmuAccomplished3466",
    "subreddit": "automation",
    "created_utc": 1747162211.0,
    "description": "What's crazy is, it runs entirely on scripts that scrape and deep-research leads online. It finds potential clients, verifies their info, digs into their company details, then crafts hyper-personalized outreach and follow-up emails—all automated.\n\nNo expensive software needed. Just some Python scripts, OpenAI's API, and a cheap scraping tool subscription.\n\nInitially, it was just an experiment… now it consistently books calls for me on autopilot. Prospects love how tailored each email feels, not realizing it's AI-driven.\n\nAll the leads flow straight into my CRM—fully vetted, warmed-up, and ready for closing.\n\nIf you're in sales, agency work, or just want to automate your outreach, here's the setup I used: (Tried to upload the workflow link here but Reddit doesn't allow me to include links?)\n\n  \n\n\nhttps://preview.redd.it/7dis7o43il0f1.png?width=1470&amp;format=png&amp;auto=webp&amp;s=7b7846aa8b5233966ffb71173239bd5aa3dd1968\n\nThis AI agent completely transformed my sales process. ",
    "comments": 42,
    "analysis": "The user is sharing their success with an AI-driven automated lead generation and outreach system that books high-ticket meetings without manual emailing, detailing the setup involving Python scripts, OpenAI's API, and scraping tools.",
    "sentiment": "sharing",
    "analysis_timestamp": "2025-05-19T20:14:56-0400"
  },
  {
    "id": "1ko19n1",
    "title": "What’s the most time you’ve saved by automating a single task?",
    "url": "https://www.reddit.com/r/automation/comments/1ko19n1/whats_the_most_time_youve_saved_by_automating_a/",
    "author": "kongaichatbot",
    "subreddit": "automation",
    "created_utc": 1747403191.0,
    "description": "I automated client onboarding and clawed back 10+ hours/week. What’s your biggest automation win? (Extra credit if it’s something unexpected!)",
    "comments": 42,
    "analysis": "The user is discussing time saved through automation using Apple Shortcuts and is asking others to share their biggest automation wins.",
    "sentiment": "need help",
    "analysis_timestamp": "2025-05-19T20:14:57-0400"
  },
  {
    "id": "1kmw71g",
    "title": "What ai automations to learn to start selling ?",
    "url": "https://www.reddit.com/r/automation/comments/1kmw71g/what_ai_automations_to_learn_to_start_selling/",
    "author": "Ok-Drama-6800",
    "subreddit": "automation",
    "created_utc": 1747272639.0,
    "description": "Hey i am wondering where to start and what i can sell any thoughts learnt from this a bit r/AiAgentss",
    "comments": 21,
    "analysis": "The user is seeking advice on which AI automations to learn in order to start selling them and is asking for suggestions or ideas.",
    "sentiment": "need help",
    "analysis_timestamp": "2025-05-19T20:15:00-0400"
  },
  {
    "id": "1klya3v",
    "title": "Funny how some of my most useful automations are the least “impressive”",
    "url": "https://www.reddit.com/r/automation/comments/1klya3v/funny_how_some_of_my_most_useful_automations_are/",
    "author": "BetterTea5664",
    "subreddit": "automation",
    "created_utc": 1747172421.0,
    "description": "Was just thinking today how the automations I use the most aren’t the complex ones. Not the fancy API stuff or multi tool chains.\n\nIt’s the tiny ones, like a script that closes distracting tabs after 10 minutes, or a timed calendar block that says “Stop. You’re looping.”\n\nThey’re barely worth showing off, but they help way more than I expected.\nAnyone else feel like that?",
    "comments": 11,
    "analysis": "The user is reflecting on how their most helpful Apple Shortcuts automations are simple and practical rather than complex or flashy, and is seeking to engage others who might feel the same.",
    "sentiment": "need help",
    "analysis_timestamp": "2025-05-19T20:15:01-0400"
  },
  {
    "id": "1klgbnw",
    "title": "Experience with n8n and zapier",
    "url": "https://www.reddit.com/r/automation/comments/1klgbnw/experience_with_n8n_and_zapier/",
    "author": "Melodic_Bar8508",
    "subreddit": "automation",
    "created_utc": 1747122925.0,
    "description": "I’ve been in the automation game for over 6 years, working with all kinds of workflows—price monitoring, stock adjustments, inventory management, invoice generation—you name it.\n\nRecently, I took a deep dive into Zapier and n8n, and while they are impressive tools, I can’t help but feel like people are getting oversold. Zapier’s pricing, for example, is insane for what it offers. Basic automations that can be handled with a simple Python script hosted on a $10 VPS are costing people hundreds of dollars a year in platform fees.\n\nLike some automations such as regular price monitoring from a supplier’s site, stock adjustments based on inventory changes, automated invoice generation and emailing\n\nAll of these can be done with a lightweight Python script and a cheap VPS. Lifetime cost? Less than a single yearly plan on Zapier for 10k–20k runs.\n\nOf course, Zapier and n8n shine when you need massive cross-platform integration with complex workflows—no argument there. But for small to medium automation? It’s overkill and expensive.\n\nNext time someone suggests Zapier or n8n, ask a Python or JavaScript developer if it really needs that, or if you’re just paying for convenience. You might be surprised at the savings.\n\nTL;DR: Zapier is great, but it’s not always necessary. Many tasks can be automated with Python for a fraction of the cost.",
    "comments": 23,
    "analysis": "The user is sharing their perspective and experience comparing automation tools Zapier and n8n, arguing that for small to medium automation tasks, simpler solutions like Python scripts on inexpensive VPS can be much more cost-effective than Zapier's pricing model.",
    "sentiment": "sharing",
    "analysis_timestamp": "2025-05-19T20:15:03-0400"
  },
  {
    "id": "1kq3579",
    "title": "Turned my Excel hobby into a side hustle… now what?",
    "url": "https://www.reddit.com/r/automation/comments/1kq3579/turned_my_excel_hobby_into_a_side_hustle_now_what/",
    "author": "AbhizzzUchiha",
    "subreddit": "automation",
    "created_utc": 1747629214.0,
    "description": "Hey folks! So, I’ve been using advanced Excel for 10+ years and recently started making automation reports for some business contacts just for fun. Turns out they loved it and recommended me to others. I’ve been doing it for free so far, but now I’m thinking — maybe I should start charging. Any idea how to go about this? Would love to hear your suggestions!",
    "comments": 10,
    "analysis": "The user has been using advanced Excel skills to create automated reports as a hobby, which has gained some demand among business contacts. They are now considering turning this hobby into a paid side hustle and are seeking advice on how to start charging for their services.",
    "sentiment": "need help",
    "analysis_timestamp": "2025-05-19T20:15:05-0400"
  },
  {
    "id": "1klln9q",
    "title": "Save my hair...script is driving me nuts!",
    "url": "https://www.reddit.com/r/applescript/comments/1klln9q/save_my_hairscript_is_driving_me_nuts/",
    "author": "Viral-strayne",
    "subreddit": "applescript",
    "created_utc": 1747142109.0,
    "description": "Hello all! \n\nI have a question for the folks who would be more advanced that me at this sort of thing. I have created an App for my business which help logs cases / categories which all works fine. \n\nWe have multiply languages in here but all cases are logged in English. I have my script running to a point where the logging is fine and the script will check the language you are using on your input (keyboard) save this, change it to British to type out what is needed then revert back to the language you are using mainly. \n\nHOWEVER, it will not process Russian at all. The script will not transfer from RU--&gt; EN --&gt; RU. It is more than likely down to the cyrillic itself but its the one thing stopping the process now. Would anyone have any tips for this to work? I have ran this through GROK, chatGPT but no luck so far :-( \n\n\n\n\n\ntry\n\tdo shell script \"echo 'Script started: $(date)' &gt; \" &amp; debugLog\nend try\n\n-- Helper to log messages\non logToFile(message)\n\ttry\n\t\tdo shell script \"echo \" &amp; quoted form of message &amp; \" &gt;&gt; \" &amp; debugLog\n\tend try\nend logToFile\n\n-- Get the current input source\nset originalInputSource to \"\"\ntry\n\tmy logToFile(\"Reading current input source\")\n\tset originalInputSource to do shell script \"defaults read com.apple.HIToolbox AppleCurrentKeyboardLayoutInputSourceID\"\n\tmy logToFile(\"Current input source: \" &amp; originalInputSource)\n\tdisplay notification \"Current input source: \" &amp; originalInputSource with title \"Input Source\"\non error errMsg\n\tmy logToFile(\"Error reading current input source: \" &amp; errMsg)\n\tdisplay notification \"Error reading current input source: \" &amp; errMsg with title \"Input Source\"\n\tset originalInputSource to \"\"\nend try\n\n-- Get available input sources\nset availableSources to \"\"\ntry\n\tmy logToFile(\"Reading available input sources\")\n\tset availableSources to do shell script \"defaults read com.apple.HIToolbox AppleEnabledInputSources\"\n\tmy logToFile(\"Available sources: \" &amp; availableSources)\non error errMsg\n\tmy logToFile(\"Error reading available input sources: \" &amp; errMsg)\n\tdisplay notification \"Error reading available input sources: \" &amp; errMsg with title \"Input Source\"\n\treturn\nend try\n\n-- Find the British input source ID\nset desiredInputSource to \"\"\ntry\n\tmy logToFile(\"Checking for British input source\")\n\tset normalizedSources to do shell script \"echo \" &amp; quoted form of availableSources &amp; \" | tr -d '\n\t' | tr -s ' ' | tr '[:upper:]' '[:lower:]'\"\n\tmy logToFile(\"Normalized sources: \" &amp; normalizedSources)\n\t\n\tif normalizedSources contains \"keyboardlayout name = british\" then\n\t\tset desiredInputSource to \"com.apple.keylayout.British\"\n\t\tmy logToFile(\"Detected British ID: \" &amp; desiredInputSource)\n\telse if normalizedSources contains \"keyboardlayout name = british-pc\" then\n\t\tset desiredInputSource to \"com.apple.keylayout.British-PC\"\n\t\tmy logToFile(\"Detected British ID: \" &amp; desiredInputSource)\n\telse if availableSources contains \"British\" then\n\t\tset desiredInputSource to \"com.apple.keylayout.British\"\n\t\tmy logToFile(\"Detected British ID: \" &amp; desiredInputSource)\n\tend if\n\t\n\tif desiredInputSource is \"\" then\n\t\tmy logToFile(\"British input source not found\")\n\t\tdisplay dialog \"Could not find British input source. Please ensure 'British' is added in System Settings &gt; Keyboard &gt; Input Sources.\" buttons {\"OK\"} default button \"OK\"\n\t\treturn\n\tend if\non error errMsg\n\tmy logToFile(\"Error checking input sources: \" &amp; errMsg)\n\tdisplay notification \"Error checking input sources: \" &amp; errMsg with title \"Input Source\"\n\treturn\nend try ",
    "comments": 3,
    "analysis": "The user has created an Apple Shortcut script to log business cases in English while handling multiple input languages. The script attempts to detect the user's keyboard input language, switch to British English for typing, then revert to the original language. However, the script fails to process Russian input properly, specifically in switching between Russian and English keyboard layouts. The user is seeking help or tips on how to make the script work with Cyrillic (Russian) input.",
    "sentiment": "need help",
    "analysis_timestamp": "2025-05-19T20:15:07-0400"
  }
]
