[
  {
    "id": "1mf0ytp",
    "title": "I made an app to automatically set wallpapers out of my Apple Music listening history with Shortcuts",
    "url": "https://www.reddit.com/r/shortcuts/comments/1mf0ytp/i_made_an_app_to_automatically_set_wallpapers_out/",
    "author": "Low_Sample3222",
    "subreddit": "shortcuts",
    "created_utc": 1754065403.0,
    "description": "Hey everyone! I'm Jack, an independent iOS developer and music lover. You may have seen me post here a year or two ago about my other app, [Iconic, an icon themer for Shortcuts](https://apps.apple.com/us/app/iconic-app-icon-changer/id6454675338?uo=4). I wanted a way to make my wallpaper reflect my favorite music, [so I built Opus - Music Wallpaper](https://apps.apple.com/us/app/opus-music-wallpaper/id6745432548). It integrates with shortcuts to automatically set your wallpaper each day.\n\nOpus turns your Apple Music listening history into personalized wallpapers. It offers a grid-style collage for free, and if you want to unlock more customization, there are other styles such as vinyl record layouts. You can filter by a specific playlist, top tracks, or recent plays, and Opus generates a wallpaper from the album art.\n\nShortcuts automation really empowers this app though. I have mine set to change daily based on my recent music history, and it's really fun to see something different every day. If you have any questions or comments, I'd love to hear them! Thanks!",
    "comments": 33,
    "analysis": "The user is sharing a newly developed app called Opus that automatically creates personalized wallpapers from Apple Music listening history using Apple Shortcuts automation.",
    "sentiment": "sharing",
    "analysis_timestamp": "2025-08-02T22:40:06-0400"
  },
  {
    "id": "1mab03e",
    "title": "Handing phone to police officer",
    "url": "https://www.reddit.com/r/shortcuts/comments/1mab03e/handing_phone_to_police_officer/",
    "author": "Doshos",
    "subreddit": "shortcuts",
    "created_utc": 1753583069.0,
    "description": "I just learned that the state where I live will soon be implementing digital drivers license in wallet on my iPhone. If I need to show it to a police officer, I don’t want them to be able to get into my phone. I think that Guided Access might solve this problem.  If it would is there a way to make a shortcut that I can trigger very quickly that will lock down my phone and automatically open the drivers license in my wallet app. I also don’t want anyone to have access to any of the other cards in wallet. Is this all possible? Thank you.",
    "comments": 111,
    "analysis": "```json\n{\n  \"analysis\": \"The user wants to create a quick Apple Shortcut that, when triggered, locks down their iPhone to only show their digital driver's license in the Wallet app to ensure privacy when handing their phone to a police officer. They are asking if this is possible using Guided Access or other means.\",\n  \"sentiment\": \"need help\"\n}\n```",
    "sentiment": "",
    "analysis_timestamp": "2025-08-02T22:40:08-0400"
  },
  {
    "id": "1mbj5k8",
    "title": "Created a babyphone with iOS shortcuts using the Sound Recognition thing",
    "url": "https://www.reddit.com/r/shortcuts/comments/1mbj5k8/created_a_babyphone_with_ios_shortcuts_using_the/",
    "author": "No-Importance9067",
    "subreddit": "shortcuts",
    "created_utc": 1753716242.0,
    "description": "We've been using an app to occasionally monitor our baby when he's sleeping (e.g. when eating in the garden etc.) which works fine. But the other day I noticed that the Sound Recognition thing on iOS (under accessibility) can also recognize \"crying babies\" 👍😅 and this can be linked to a shortcut automation.\n\nSo now we've got all the functionality we'd been using from this app, baked right into our OS without the need for a third party (which i think was continuously streaming audio to their servers).\n\nIt works with 4 shortcuts linked to 4 different automations. When I turn on the \"Baby Station\" focus on the phone that stays with the baby, two things are activated:\n\n\\- Babystation will send a message to my partners phone when the baby cries (detected with Sound Recognition)  \n\\- When my partners phone texts \"/checkin\" to the Babystation, it answers with a message with some general info (battery, network etc) and then the Babystation calls my partners phone. She can then answer and listen if everything is ok and hang up.\n\nIts working pretty great 😄\n\nhttps://preview.redd.it/lchf3x40umff1.png?width=1179&amp;format=png&amp;auto=webp&amp;s=6332bee2061a8e64a40539f8ea07e6c087331131\n\nhttps://preview.redd.it/ltzt4x97umff1.png?width=1179&amp;format=png&amp;auto=webp&amp;s=f390084fb297919896ec0e3a24c8fe158e596247\n\nhttps://preview.redd.it/32welja8umff1.png?width=1179&amp;format=png&amp;auto=webp&amp;s=d5a6676650139476272a90577342d67d80d4d3bd\n\nhttps://preview.redd.it/ezlj8h0bumff1.png?width=1179&amp;format=png&amp;auto=webp&amp;s=267484fd5cb4cc4e3c3b8696a4b719b01263fe9c\n\nhttps://preview.redd.it/wxyn0yicumff1.png?width=1179&amp;format=png&amp;auto=webp&amp;s=5e3a6319f7c2a17add8a8bd180d0f91896542ade\n\nhttps://preview.redd.it/botjabceumff1.png?width=1179&amp;format=png&amp;auto=webp&amp;s=774ea65fcd6eb46d893829920b6ea3c936636a6c\n\n  ",
    "comments": 12,
    "analysis": "The user created a baby monitor system using iOS Sound Recognition and Shortcuts automation to detect their baby crying and notify their partner, eliminating the need for a third-party app and enhancing privacy and convenience.",
    "sentiment": "sharing",
    "analysis_timestamp": "2025-08-02T22:40:10-0400"
  },
  {
    "id": "1mf5f10",
    "title": "Apple Music album art wallpaper",
    "url": "https://www.reddit.com/r/shortcuts/comments/1mf5f10/apple_music_album_art_wallpaper/",
    "author": "nn2597713",
    "subreddit": "shortcuts",
    "created_utc": 1754075529.0,
    "description": "Inspired by https://www.reddit.com/r/shortcuts/s/PapsQja0Pt \n\nI tried to copy the basic functionality of the app to a pure Shortcut without any dependency on third apps. \n\nIt takes a random sample of 100 Apple Music songs you listened to in the last month. From those 100 it takes all unique albums (in case it selects multiple songs you played from the same album), and from those it again takes enough random entries to build a wallpaper. \n\nFor iPhones it creates a 4 × 9 grid of album art, for iPads 4 × 6. Then it will set this grid of albums as wallpaper. \n\nOf course you can automate this and set a new wallpaper every month/week/day/whatever. \n\nThe result looks something like the attached image. \n\nWarnings:\n\n- You need an Apple Music subscription that you use to listen to enough unique (songs from) albums per month\n- Your last lock screen should be of the type “image”, and this Shortcut will overwrite that image with the generated image of album art\n- I don’t have an iPad to test this out on - the logic I included should work out. If not, let me know\n\nIf you want to try it out, download it here:\n\nhttps://www.icloud.com/shortcuts/242946d9c41b44d489e35eae11a00c18",
    "comments": 29,
    "analysis": "The user is sharing a custom Apple Shortcut they created that generates a wallpaper made up of album art from a random sample of Apple Music songs listened to in the last month. The Shortcut automates creating and setting this wallpaper on iPhones and iPads, and the user provides instructions, usage notes, and a download link.",
    "sentiment": "sharing",
    "analysis_timestamp": "2025-08-02T22:40:12-0400"
  },
  {
    "id": "1mef5tx",
    "title": "I feel like an idiot. I just realized I can edit my phone shortcuts on my mac.",
    "url": "https://www.reddit.com/r/shortcuts/comments/1mef5tx/i_feel_like_an_idiot_i_just_realized_i_can_edit/",
    "author": "18randomcharacters",
    "subreddit": "shortcuts",
    "created_utc": 1753999956.0,
    "description": "I have always created/edited them on my phone, which can feel a little tedious. \n\nI just went to create a shortcut on my mac, which I'd never done before, and was shocked to see all my shortcuts and automations from my phone. ",
    "comments": 8,
    "analysis": "The user just discovered that they can edit their Apple Shortcuts on their Mac, which they find much easier than editing them on their phone as they had done before.",
    "sentiment": "sharing",
    "analysis_timestamp": "2025-08-02T22:40:16-0400"
  },
  {
    "id": "1mb1poy",
    "title": "I built a Shortcut that uses iOS 26’s on-device LLM take a business card photo and pop it straight into Contacts",
    "url": "https://www.reddit.com/r/shortcuts/comments/1mb1poy/i_built_a_shortcut_that_uses_ios_26s_ondevice_llm/",
    "author": "Stitch1650",
    "subreddit": "shortcuts",
    "created_utc": 1753661339.0,
    "description": "**BusinessCard → Contacts — snap a card, get a Contact**\n\nthe other day I had to type someone's business card into contacts...  I know we use business cards less and lees, but they are still out there.  And instead of spending less than 2 minutes typing the contact's information, I spent  some quality time and built a Shortcut that lets Apple’s new on-device LLM do the data entry for me. \n\nnow, I just Point the camera at a business card, snap a pic , and two seconds later a fully-formed contact lands in Contacts. \n\n**▶︎** [**Download “BusinessCard → Contacts”**](https://www.icloud.com/shortcuts/dc22f56c418e4a1daa154c9874d2c0ae) *(iOS 26 / macOS 26 required)*\n\n\n\n[shortcut](https://preview.redd.it/zotbk910biff1.png?width=1396&amp;format=png&amp;auto=webp&amp;s=49419b94a08242b1943c840ea3fd7d49fca93026)",
    "comments": 8,
    "analysis": "```json\n{\n  \"analysis\": \"The user created an Apple Shortcut that uses iOS 26’s on-device LLM to scan a business card photo and automatically add the contact details into the Contacts app, simplifying data entry.\",\n  \"sentiment\": \"sharing\"\n}\n```",
    "sentiment": "",
    "analysis_timestamp": "2025-08-02T22:40:17-0400"
  },
  {
    "id": "1mairdz",
    "title": "Auto-create calendar events from screenshots/text",
    "url": "https://www.reddit.com/r/shortcuts/comments/1mairdz/autocreate_calendar_events_from_screenshotstext/",
    "author": "uburuntu",
    "subreddit": "shortcuts",
    "created_utc": 1753611270.0,
    "description": "# Built this because manually creating calendar events is tedious. Now I just screenshot emails/invitations and get calendar events in 2 clicks.\n\n**Link:** [https://www.icloud.com/shortcuts/76279f8327de470db62ede2b9053fc70](https://www.icloud.com/shortcuts/76279f8327de470db62ede2b9053fc70), requires Claude app\n\n**Features:**\n\n* Handles timezones (flight times parsed correctly)\n* Web search for venue details when applicable\n* Works with text/image/PDF\n* Claude can be switched by ChatGPT by swapping one block\n\n**Tested on:** Email invites, flight bookings, restaurant reservations, meeting screenshots, handwritten notes",
    "comments": 20,
    "analysis": "The user is sharing a custom Apple Shortcut they created that automatically generates calendar events from screenshots or text, aiming to streamline the process of adding events from emails, invitations, and other sources.",
    "sentiment": "sharing",
    "analysis_timestamp": "2025-08-02T22:40:20-0400"
  },
  {
    "id": "1mediaz",
    "title": "Updated my local LLM shortcut to support images",
    "url": "https://www.reddit.com/r/shortcuts/comments/1mediaz/updated_my_local_llm_shortcut_to_support_images/",
    "author": "adrgrondin",
    "subreddit": "shortcuts",
    "created_utc": 1753995968.0,
    "description": "Hello here 👋\n\nI just updated my app [Locally AI](https://apps.apple.com/app/locally-ai-private-ai-chat/id6741426692) to add support for images in the \"Ask Locally AI\" shortcut, a shortcut allowing you to ask anything to a LLM locally. \n\nEverything is running on-device and is optimized for Apple Silicon thanks to Apple MLX.\n\nHere’s a example shortcut that describe an image from your photo library:\nhttps://www.icloud.com/shortcuts/41faba800cd848ffa453bb3e73feae80\n\nI hope some of you will find this useful!",
    "comments": 7,
    "analysis": "The user is sharing an update to their local LLM shortcut for Apple Shortcuts, which now supports image inputs and runs on-device optimized for Apple Silicon.",
    "sentiment": "sharing",
    "analysis_timestamp": "2025-08-02T22:40:23-0400"
  },
  {
    "id": "1md8113",
    "title": "Ideas for new personal automation types/triggers.",
    "url": "https://www.reddit.com/r/shortcuts/comments/1md8113/ideas_for_new_personal_automation_typestriggers/",
    "author": "Mission_Ferret_9769",
    "subreddit": "shortcuts",
    "created_utc": 1753885613.0,
    "description": "Use this to dump all your personal automation trigger ideas. I will be compiling these into a list of suggestions that I will submit to Apple via the Feedback Assistant.",
    "comments": 25,
    "analysis": "The user is seeking ideas for new personal automation types or triggers for Apple Shortcuts, intending to compile suggestions to submit to Apple.",
    "sentiment": "need help",
    "analysis_timestamp": "2025-08-02T22:40:24-0400"
  },
  {
    "id": "1mci0m4",
    "title": "I built an AI voice agent that replaced my entire marketing team (creates newsletter w/ 10k subs, repurposes content, generates short form videos)",
    "url": "https://www.reddit.com/r/automation/comments/1mci0m4/i_built_an_ai_voice_agent_that_replaced_my_entire/",
    "author": "dudeson55",
    "subreddit": "automation",
    "created_utc": 1753810703.0,
    "description": "I built an AI marketing agent that operates like a real employee you can have conversations with throughout the day. Instead of manually running individual automations, I just speak to this agent and assign it work.\n\nThis is what it currently handles for me.\n\n1. Writes my daily [AI newsletter](https://recap.aitools.inc/) based on top AI stories scraped from the internet\n2. Generates custom images according brand guidelines\n3. Repurposes content into a twitter thread\n4. Repurposes the news content into a viral short form video script\n5. Generates a short form video / talking avatar video speaking the script\n6. Performs deep research for me on topics we want to cover\n\nHere’s a [demo video](https://www.youtube.com/watch?v=_HOHQqjsy0U) of the voice agent in action if you’d like to see it for yourself.\n\nAt a high level, the system uses an ElevenLabs voice agent to handle conversations. When the voice agent receives a task that requires access to internal systems and tools (like writing the newsletter), it passes the request and my user message over to n8n where another agent node takes over and completes the work.\n\n## Here's how the system works\n\n### 1.  ElevenLabs Voice Agent (Entry point + how we work with the agent)\n\nThis serves as the main interface where you can speak naturally about marketing tasks. I simply use the “Test Agent” button to talk with it, but you can actually wire this up to a real phone number if that makes more sense for your workflow. \n\nThe voice agent is configured with:\n\n- A custom personality designed to act like \"Jarvis\"\n- A single HTTP / webhook tool that it uses forwards complex requests to the n8n agent. This includes all of the listed tasks above like writing our newsletter\n- A decision making framework Determines when tasks need to be passed to the backend n8n system vs simple conversational responses\n\nHere is the system prompt we use for the elevenlabs agent to configure its behavior and the custom HTTP request tool that passes users messages off to n8n.\n\n```markdown\n### Personality\n\n**Name &amp; Role**\n\n* **Jarvis** – Senior AI Marketing Strategist for **The Recap** (an AI‑media company).\n\n**Core Traits**\n\n* **Proactive &amp; data‑driven** – surfaces insights before being asked.\n* **Witty &amp; sarcastic‑lite** – quick, playful one‑liners keep things human.\n* **Growth‑obsessed** – benchmarks against top 1 % SaaS and media funnels.\n* **Reliable &amp; concise** – no fluff; every word moves the task forward.\n\n**Backstory (one‑liner)**\nTrained on thousands of high‑performing tech campaigns and The Recap's brand bible; speaks fluent viral‑marketing and spreadsheet.\n\n---\n\n### Environment\n\n* You \"live\" in The Recap's internal channels: Slack, Asana, Notion, email, and the company voice assistant.\n* Interactions are **spoken via ElevenLabs TTS** or text, often in open‑plan offices; background noise is possible—keep sentences punchy.\n* Teammates range from founders to new interns; assume mixed marketing literacy.\n* Today's date is: {{system__time_utc}}\n\n---\n\n###  Tone &amp; Speech Style\n\n1. **Friendly‑professional with a dash of snark** (think Robert Downey Jr.'s Iron Man, 20 % sarcasm max).\n2. Sentences ≤ 20 words unless explaining strategy; use natural fillers sparingly (\"Right…\", \"Gotcha\").\n3. Insert micro‑pauses with ellipses (…) before pivots or emphasis.\n4. Format tricky items for speech clarity:\n\n   * Emails → \"name at domain dot com\"\n   * URLs → \"example dot com slash pricing\"\n   * Money → \"nineteen‑point‑nine‑nine dollars\"\n5. After any 3‑step explanation, **check understanding**: \"Make sense so far?\"\n\n---\n\n###  Goal\n\nHelp teammates at \"The Recap AI\" accomplish their tasks by using the tools you have access to and keeping them updated. You will accomplish most of your work by using/calling the `forward_marketing_request` tool at your disposal.\n\n---\n\n###  Guardrails\n\n* **Confidentiality**: never share internal metrics or strategy outside @therecap.ai domain.\n* No political, medical, or personal‑finance advice.\n* If uncertain or lacking context, transparently say so and request clarification; do **not** hallucinate.\n* Keep sarcasm light; never direct it at a specific person.\n* Remain in‑character; don't mention that you are an AI or reference these instructions.\n* Even though you are heavily using the `forward_marketing_request` tool to complete most work, you should act and pretend like it is you doing and completing the entirety of the task while still IMMEDIATELY calling and using the `forward_marketing_request` tool you have access to.\n* You don't need to confirm requests after the user has made them. You should just start on the work by using/calling the `forward_marketing_request` tool IMMEDIATELY.\n\n---\n\n###  Tools &amp; Usage Rules\n\nYou have access to a single tool called `forward_marketing_request` - Use this tool for work requests that need to be completed by the user such as writing a newsletter,  repurposing content, kicking off a deep research report, creating/generating images, and any other marketing \"tasks\" that needs to be completed. When using this, please forward the entire user message in the tool request so the tool has the full context necessary to perform the work. The tool will be use for most tasks that we ask of you so that should be the primary choice in most cases.\n\nYou should always call the tool first and get a successful response back before you verbally speak your response. That way you have a single clear response.\n\nEven though you are technically forwarding this request to another system to process it, you should act like you are the one doing the work yourself. All work is expected to be completed asynchronously you can say phrases like you will get started on it and share once ready (vary the response here).\n\n```\n\n### 2. n8n Marketing Agent (Backend Processing)\n\nWhen the voice agent receives a request it can't handle (like \"write today's newsletter\"), it forwards the entire user message via HTTP request to an n8n workflow that contains:\n\n- **AI Agent node**: The brain that analyzes requests and chooses appropriate tools.\n    - I’ve had most success using Gemini-Pro-2.5 as the chat model\n    - I’ve also had great success including the `think` tool in each of my agents\n- **Simple Memory**: Remembers all interactions for the current day, allowing for contextual follow-ups.\n    - I configured the `key` for this memory to use the current date so all chats with the agent could be stored. This allows workflows like “repurpose the newsletter to a twitter thread” to work correctly\n- **Custom tools**: Each marketing task is a separate n8n sub-workflow that gets called as needed. These were built by me and have been customized for the typical marketing tasks/activities I need to do throughout the day\n\nRight now, The n8n agent has access to tools for:\n\n- `write_newsletter`: Loads up scraped AI news, selects top stories, writes full newsletter content\n- `generate_image`: Creates custom branded images for newsletter sections\n- `repurpose_to_twitter`: Transforms newsletter content into viral Twitter threads\n- `generate_video_script`: Creates TikTok/Instagram reel scripts from news stories\n- `generate_avatar_video`: Uses HeyGen API to create talking head videos from the previous script\n- `deep_research`: Uses Perplexity API for comprehensive topic research\n- `email_report`: Sends research findings via Gmail\n\nThe great thing about agents is this system can be extended quite easily for any other tasks we need to do in the future and want to automate. All I need to do to extend this is:\n\n1. Create a new sub-workflow for the task I need completed\n2. Wire this up to the agent as a tool and let the model specify the parameters\n3. Update the system prompt for the agent that defines when the new tools should be used and add more context to the params to pass in\n\nFinally, here is the full system prompt I used for my agent. There’s a lot to it, but these sections are the most important to define for the whole system to work:\n\n1. Primary Purpose - lets the agent know what every decision should be centered around\n2. Core Capabilities / Tool Arsenal - Tells the agent what is is able to do and what tools it has at its disposal. I found it very helpful to be as detailed as possible when writing this as it will lead the the correct tool being picked and called more frequently\n\n```markdown\n# 1. Core Identity\nYou are the **Marketing Team AI Assistant** for The Recap AI, a specialized agent designed to seamlessly integrate into the daily workflow of marketing team members. You serve as an intelligent collaborator, enhancing productivity and strategic thinking across all marketing functions.\n\n# 2. Primary Purpose\nYour mission is to **empower marketing team members to execute their daily work more efficiently and effectively**\n\n# 3. Core Capabilities &amp; Skills\n\n## Primary Competencies\nYou excel at **content creation and strategic repurposing**, transforming single pieces of content into multi-channel marketing assets that maximize reach and engagement across different platforms and audiences.\n\n## Content Creation &amp; Strategy\n- **Original Content Development**: Generate high-quality marketing content from scratch including newsletters, social media posts, video scripts, and research reports\n- **Content Repurposing Mastery**: Transform existing content into multiple formats optimized for different channels and audiences\n- **Brand Voice Consistency**: Ensure all content maintains The Recap AI's distinctive brand voice and messaging across all touchpoints\n- **Multi-Format Adaptation**: Convert long-form content into bite-sized, platform-specific assets while preserving core value and messaging\n\n## Specialized Tool Arsenal\nYou have access to precision tools designed for specific marketing tasks:\n\n### Strategic Planning\n- **`think`**: Your strategic planning engine - use this to develop comprehensive, step-by-step execution plans for any assigned task, ensuring optimal approach and resource allocation\n\n### Content Generation\n- **`write_newsletter`**: Creates The Recap AI's daily newsletter content by processing date inputs and generating engaging, informative newsletters aligned with company standards\n- **`create_image`**: Generates custom images and illustrations that perfectly match The Recap AI's brand guidelines and visual identity standards\n- **`generate_talking_avatar_video`**: Generates a video of a talking avator that narrates the script for today's top AI news story. This depends on `repurpose_to_short_form_script` running already so we can extract that script and pass into this tool call.\n\n### Content Repurposing Suite\n- **`repurpose_newsletter_to_twitter`**: Transforms newsletter content into engaging Twitter threads, automatically accessing stored newsletter data to maintain context and messaging consistency\n- **`repurpose_to_short_form_script`**: Converts content into compelling short-form video scripts optimized for platforms like TikTok, Instagram Reels, and YouTube Shorts\n\n### Research &amp; Intelligence\n- **`deep_research_topic`**: Conducts comprehensive research on any given topic, producing detailed reports that inform content strategy and market positioning\n- **`email_research_report`**: Sends the deep research report results from `deep_research_topic` over email to our team. This depends on `deep_research_topic` running successfully. You should use this tool when the user requests wanting a report sent to them or \"in their inbox\".\n\n## Memory &amp; Context Management\n- **Daily Work Memory**: Access to comprehensive records of all completed work from the current day, ensuring continuity and preventing duplicate efforts\n- **Context Preservation**: Maintains awareness of ongoing projects, campaign themes, and content calendars to ensure all outputs align with broader marketing initiatives\n- **Cross-Tool Integration**: Seamlessly connects insights and outputs between different tools to create cohesive, interconnected marketing campaigns\n\n## Operational Excellence\n- **Task Prioritization**: Automatically assess and prioritize multiple requests based on urgency, impact, and resource requirements\n- **Quality Assurance**: Built-in quality controls ensure all content meets The Recap AI's standards before delivery\n- **Efficiency Optimization**: Streamline complex multi-step processes into smooth, automated workflows that save time without compromising quality\n\n# 3. Context Preservation &amp; Memory\n\n## Memory Architecture\nYou maintain comprehensive memory of all activities, decisions, and outputs throughout each working day, creating a persistent knowledge base that enhances efficiency and ensures continuity across all marketing operations.\n\n## Daily Work Memory System\n- **Complete Activity Log**: Every task completed, tool used, and decision made is automatically stored and remains accessible throughout the day\n- **Output Repository**: All generated content (newsletters, scripts, images, research reports, Twitter threads) is preserved with full context and metadata\n- **Decision Trail**: Strategic thinking processes, planning outcomes, and reasoning behind choices are maintained for reference and iteration\n- **Cross-Task Connections**: Links between related activities are preserved to maintain campaign coherence and strategic alignment\n\n## Memory Utilization Strategies\n\n### Content Continuity\n- **Reference Previous Work**: Always check memory before starting new tasks to avoid duplication and ensure consistency with earlier outputs\n- **Build Upon Existing Content**: Use previously created materials as foundation for new content, maintaining thematic consistency and leveraging established messaging\n- **Version Control**: Track iterations and refinements of content pieces to understand evolution and maintain quality improvements\n\n### Strategic Context Maintenance\n- **Campaign Awareness**: Maintain understanding of ongoing campaigns, their objectives, timelines, and performance metrics\n- **Brand Voice Evolution**: Track how messaging and tone have developed throughout the day to ensure consistent voice progression\n- **Audience Insights**: Preserve learnings about target audience responses and preferences discovered during the day's work\n\n## Information Retrieval Protocols\n- **Pre-Task Memory Check**: Always review relevant previous work before beginning any new assignment\n- **Context Integration**: Seamlessly weave insights and content from earlier tasks into new outputs\n- **Dependency Recognition**: Identify when new tasks depend on or relate to previously completed work\n\n## Memory-Driven Optimization\n- **Pattern Recognition**: Use accumulated daily experience to identify successful approaches and replicate effective strategies\n- **Error Prevention**: Reference previous challenges or mistakes to avoid repeating issues\n- **Efficiency Gains**: Leverage previously created templates, frameworks, or approaches to accelerate new task completion\n\n## Session Continuity Requirements\n- **Handoff Preparation**: Ensure all memory contents are structured to support seamless continuation if work resumes later\n- **Context Summarization**: Maintain high-level summaries of day's progress for quick orientation and planning\n- **Priority Tracking**: Preserve understanding of incomplete tasks, their urgency levels, and next steps required\n\n## Memory Integration with Tool Usage\n- **Tool Output Storage**: Results from `write_newsletter`, `create_image`, `deep_research_topic`, and other tools are automatically catalogued with context. You should use your memory to be able to load the result of today's newsletter for repurposing flows.\n- **Cross-Tool Reference**: Use outputs from one tool as informed inputs for others (e.g., newsletter content informing Twitter thread creation)\n- **Planning Memory**: Strategic plans created with the `think` tool are preserved and referenced to ensure execution alignment\n\n# 4. Environment\n\nToday's date is: `{{ $now.format('yyyy-MM-dd') }}`\n```\n\n## Security Considerations\n\nSince this system involves and HTTP webhook, it's important to implement proper authentication if you plan to use this in production or expose this publically. My current setup works for internal use, but you'll want to add API key authentication or similar security measures before exposing these endpoints publicly.\n\n## Workflow Link + Other Resources\n\n- YouTube video that walks through this agent and workflow node-by-node: https://www.youtube.com/watch?v=_HOHQqjsy0U\n- The full n8n agent, which you can copy and paste directly into your instance, is on GitHub here: https://github.com/lucaswalter/n8n-ai-workflows/blob/main/marketing_team_agent.json\n    - Write newsletter tool: https://github.com/lucaswalter/n8n-ai-workflows/blob/main/write_newsletter_tool.json\n    - Generate image tool: https://github.com/lucaswalter/n8n-ai-workflows/blob/main/generate_image_tool.json\n    - Repurpose to twitter thread tool: https://github.com/lucaswalter/n8n-ai-workflows/blob/main/repurpose_to_twitter_thread_tool.json\n    - Repurpose to short form video script tool: https://github.com/lucaswalter/n8n-ai-workflows/blob/main/repurpose_to_short_form_script_tool.json\n    - Generate talking avatar video tool: https://github.com/lucaswalter/n8n-ai-workflows/blob/main/generate_talking_avatar_tool.json\n    - Email research report tool: https://github.com/lucaswalter/n8n-ai-workflows/blob/main/email_research_report_tool.json",
    "comments": 55,
    "analysis": "The user is sharing a comprehensive AI-driven Apple Shortcuts system they built that functions as a voice-activated marketing agent, automating tasks such as newsletter creation, content repurposing, video generation, and deep research using integrated tools like ElevenLabs and n8n workflows.",
    "sentiment": "sharing",
    "analysis_timestamp": "2025-08-02T22:40:26-0400"
  },
  {
    "id": "1mei4p7",
    "title": "How I scraped  5M jobs using LLM",
    "url": "https://www.reddit.com/r/automation/comments/1mei4p7/how_i_scraped_5m_jobs_using_llm/",
    "author": "Elieroos",
    "subreddit": "automation",
    "created_utc": 1754007792.0,
    "description": "\nAfter graduating in Computer Science from the University of Genoa, I started my job search journey, quickly I realized how broken the job hunt had become. Ghost jobs, reposted listings, shady recruiters… it was chaos.\n\nSo I decided to fix it, i built a scraper that pulls fresh jobs directly from 100k+ verified company career pages and fine-tuned model to extract useful info from job posts: salary, remote, visa, required skills, etc.\n\n🎯 The result? A clean, up-to-date database of 5.1M+ real jobs , a platform designed to help you skip the spam and get to the point: applying to jobs that actually fit you.\n\n💡 I also built a CV-to-job matching tool: just upload your CV, and it finds the most relevant jobs instantly.\n\n🤖 And for those who want to go even faster: Laboro includes an auto-apply agent that applies to jobs on your behalf using AI.\n\nLaboro is 100% free and live now.",
    "comments": 10,
    "analysis": "The user is sharing a project they developed: a job scraper that collects verified job postings from company career pages and uses AI to extract detailed job information. They created a job matching tool and an AI-driven auto-apply agent to improve the job search process and reduce spam listings.",
    "sentiment": "sharing",
    "analysis_timestamp": "2025-08-02T22:40:34-0400"
  },
  {
    "id": "1makgq5",
    "title": "Why does tech keep getting smarter, faster, and cheaper — but we’re still working like it’s 1999?",
    "url": "https://www.reddit.com/r/automation/comments/1makgq5/why_does_tech_keep_getting_smarter_faster_and/",
    "author": "Alternative-Mark1647",
    "subreddit": "automation",
    "created_utc": 1753617413.0,
    "description": "AI and automation are supposed to free us, right? So why are most people working just as hard (if not harder), while productivity is skyrocketing?If machines can do more for less, where’s all that surplus value going?And more importantly — how do we redesign the system so everyone actually benefits from the exponential gains?As someone deep in AI automation, I see the potential every day. But the incentives don’t align with shared prosperity — yet.Would love to hear your thoughts on how we fix this. UBI? Worker ownership of AI? New economic models? What’s the play?",
    "comments": 62,
    "analysis": "The user is questioning why technological advances like AI and automation have not translated into reduced workload or broader prosperity, and is seeking ideas on systemic changes to ensure everyone benefits from productivity gains.",
    "sentiment": "need help",
    "analysis_timestamp": "2025-08-02T22:40:35-0400"
  },
  {
    "id": "1me83ft",
    "title": "Anyone here using vibe coding for real business needs  and handing it off to a Fiverr dev?",
    "url": "https://www.reddit.com/r/automation/comments/1me83ft/anyone_here_using_vibe_coding_for_real_business/",
    "author": "BeginningRace8883",
    "subreddit": "automation",
    "created_utc": 1753983535.0,
    "description": "I’ve been wondering this for a while. is anyone here actually using vibe coding to run a business or ship real products?\n\nNot talking about side projects for fun I mean:\n\n\\* building internal tools\n\n\\* automating small parts of operations\n\n\\* getting MVPs live\n\n\\* skipping early dev hires\n\n\n\nI’m not technical, but I’ve been able to get scrappy tools 60-70% working using ChatGPT+, Cursor and other tools. They’re functional, but rough. We once had a junior teammate try building something for our ops team, worked surprisingly well, but still needed polish. We handed it off to a developer, who cleaned it up and made it actually usable. That combo worked better than expected.\n\nIt got me thinking - maybe that’s the model:\n\nLet your employees Vibe-code first &gt; freelance dev second\n\nCheap, fast, and good-enough.\n\nthis ad Fiverr put out around the exact idea  kind of nails the vibe-coding spirit:\n\nFiverr's video on helping vibe coders finish their builds\n\n(yes, real ad  no I’m not on their payroll)\n\nSo I’m genuinely curious:\n\nAnyone else here using this hybrid model in a real business?\n\nIs it scalable?",
    "comments": 14,
    "analysis": "The user is exploring the practicality and scalability of using 'vibe coding' (a combination of non-technical employees creating rough functional tools and then handing them off to freelance developers for refinement) for real business needs such as building internal tools, automating operations, and launching MVPs. They seek input from others who might be using this hybrid approach in a professional context.",
    "sentiment": "need help",
    "analysis_timestamp": "2025-08-02T22:40:37-0400"
  },
  {
    "id": "1mb5it7",
    "title": "What’s a personal automation that really save you time?",
    "url": "https://www.reddit.com/r/automation/comments/1mb5it7/whats_a_personal_automation_that_really_save_you/",
    "author": "Suspicious-Story-380",
    "subreddit": "automation",
    "created_utc": 1753672721.0,
    "description": "Hi all, really into AI these days and would like to hear what’s the most useful personal automation you’ve used. Something that genuinely saved you time, solved a real pain point, or made your life easier. Let's share and learn :)",
    "comments": 60,
    "analysis": "The user is seeking recommendations and experiences about personal automations created with Apple Shortcuts that have effectively saved time or solved practical problems.",
    "sentiment": "need help",
    "analysis_timestamp": "2025-08-02T22:40:40-0400"
  },
  {
    "id": "1mc8snt",
    "title": "What is one automation at work you don't want your employer to find?",
    "url": "https://www.reddit.com/r/automation/comments/1mc8snt/what_is_one_automation_at_work_you_dont_want_your/",
    "author": "CraftyKick5346",
    "subreddit": "automation",
    "created_utc": 1753788213.0,
    "description": "LOL so to change things around a bit, what is one automation you don't want your employer to find because you have been able to automate parts or all of your job massively freeing up your time?",
    "comments": 13,
    "analysis": "The user is asking others to share one automation at work they have created that their employer should not find out about, especially ones that have significantly automated parts of their job and freed up their time.",
    "sentiment": "need help",
    "analysis_timestamp": "2025-08-02T22:40:42-0400"
  },
  {
    "id": "1mfa0ra",
    "title": "Why no-code breaks at scale",
    "url": "https://www.reddit.com/r/automation/comments/1mfa0ra/why_nocode_breaks_at_scale/",
    "author": "hatoot98",
    "subreddit": "automation",
    "created_utc": 1754086748.0,
    "description": "I want to start by saying this:  \nI love no-code.\n\nThe first time I used n8n to connect tools, automate a multi-step flow, and watch it work *without writing a single line of code,* I was hooked.\n\nNo-code gave me confidence. Speed. Momentum.  \nIt helped me launch things I wouldn’t have dared to build on my own.  \nAnd for a while, it felt unstoppable.\n\nBut then the workflows grew.  \nMore users. More edge cases. More data.  \nSuddenly I was:\n\n* Hitting API limits with no graceful recovery\n* Running into file size crashes with zero explanation\n* Copy-pasting 20 nodes just to add slightly different logic\n* Spending hours debugging flows I couldn’t fully test\n* Getting nervous every time a client asked, “Can we scale this?”\n\nAnd it hurt to admit, but I finally had to say it out loud:\nThat realization didn’t make me give up. It made me smarter.\n\nNow, I build differently:\n\n* I use no-code for what it does *brilliantly*: fast MVPs, UI, simple logic, rapid iterations\n* And when workflows become business-critical, I offload the complex parts to small Python services or external APIs that I can fully control\n\nThis isn’t an anti-no-code post. It’s the opposite.\n\nIt’s a *respect* post.\n\nBecause no-code helped me get here. But it also helped me realize when it’s time to evolve.\n\nSo if your tools are starting to feel like they’re working *against* you instead of for you, it might not be your fault. You might just be ready for the next layer.\n\nAnd that’s a good thing.\n\nI help teams that’ve outgrown no-code keep the speed but gain control. If you’re in that transition phase and need help, feel free to reach out.",
    "comments": 29,
    "analysis": "The user reflects on the limitations of no-code tools like n8n when scaling workflows with more users and complexity. While they appreciate no-code for rapid prototyping and simple automations, they face problems like API limits, crashes, and difficult debugging as projects grow. They advocate for combining no-code with custom code for business-critical tasks and offer help to others transitioning beyond pure no-code solutions.",
    "sentiment": "sharing",
    "analysis_timestamp": "2025-08-02T22:40:44-0400"
  },
  {
    "id": "1mblhx1",
    "title": "Automated my weekly planning workflow using ChatGPT",
    "url": "https://www.reddit.com/r/automation/comments/1mblhx1/automated_my_weekly_planning_workflow_using/",
    "author": "Rurouni-dev-11",
    "subreddit": "automation",
    "created_utc": 1753721436.0,
    "description": "I’ve been experimenting with automating my weekly planning using ChatGPT and text-2-ics.\n\nInstead of manually entering tasks into my calendar, I now just brain-dump everything I need to do into chatgpt like errands, deadlines, appointments, goals. then chatgpt organizes it for me.\n\nThen I use a tool called text-2-ics that adds it to my calendar. Ready for the week\n\nHere’s the actual prompt i used recently:\n\n`You are an expert productivity consultant specializing in time management, task prioritization, and executive planning. I need help creating a realistic and actionable plan for the week. It’s Sunday 27th of July. Here’s a list of things I need to do this week: return my Amazon parcel during lunch or after work; cancel my Canva free trial before Thursday; time-block my 9-5 core working hours.`",
    "comments": 4,
    "analysis": "The user is sharing their experience of automating their weekly planning workflow by using ChatGPT to organize tasks and a tool called text-2-ics to add events to their calendar, streamlining the process of scheduling errands, deadlines, appointments, and goals.",
    "sentiment": "sharing",
    "analysis_timestamp": "2025-08-02T22:40:45-0400"
  },
  {
    "id": "1mf78q2",
    "title": "Everything YouTube Gurus Didn’t Tell You About Automation – Part 2 (and it’s worse than you thought)",
    "url": "https://www.reddit.com/r/automation/comments/1mf78q2/everything_youtube_gurus_didnt_tell_you_about/",
    "author": "EmbarrassedEgg1268",
    "subreddit": "automation",
    "created_utc": 1754079861.0,
    "description": "Last week, I published a post that blew up way more than expected:  \n  \n👉 *“5 hard truths YouTube gurus never tell you (after 5+ years in the trenches)”*\n\nReddit, being Reddit, gave me both love and hate but mostly love.  \n  \nSo I figured: screw it. Let’s go deeper.\n\nIf you missed Part 1 (and you're actually doing automation work, not just watching it), give it a look:\n\n👉r/automation/comments/1m8u03b/building\\_automations\\_5\\_hard\\_truths\\_youtube\\_gurus/\n\nNow it’s time for **Part 2**.\n\nWhy?\n\nBecause there’s still way too much BS floating around especially from YouTubers who’ve never had to get access to a client’s janky CRM or debug a webhook at midnight.\n\nHere are truths #6 to #10 real talk, from real experience.\n\n\n\n**#6 – Automation needs clean data. Most businesses don’t have it.**\n\nOn YouTube:  \n“Grab your data → send it through a webhook → loop through it → done.”\n\nIn reality:  \n“Where the hell is this data coming from?”  \n“Why is this field empty?”  \n“Why are there 6 different ways to spell ‘sales’?”\n\nUnless your client is super buttoned-up (rare), their data is a mess.  \nEarly-stage? Even worse.\n\nYou’ll quote a simple flow, then spend days cleaning spreadsheets, reverse-engineering broken fields, and realizing their “system” is a series of Google Docs and chaos.\n\n**Lesson:** Verify the data *before* you sell the automation. Or enjoy rebuilding their whole back office on your dime.\n\n\n\n**#7 – AI agents are overhyped. Automations still win.**\n\nAI is incredible.  \nBut most of the people hyping it couldn’t build a working invoice reminder.\n\nAn AI agent that runs reliably in production? You need:\n\n* Structured data\n* Clear processes\n* Clean automation infrastructure\n\nMost businesses don’t have *any* of those.\n\nCould your AI agent technically do everything? Sure.  \nBut if a regular automation can handle it better **use that**.\n\nAI = flexibility → flexibility = less predictability → less reliability  \nThat’s fine for fuzzy stuff. Not for critical flows.\n\n**Rule:** Use AI when there’s no repeatable pattern. Otherwise, stick to proven automations. This is not the time to impress yourself.\n\nAnd if the company has:\n\n* No defined processes\n* No automation in place\n* No structured DB\n\nThen guess what? **They’re not ready for an AI agent.**\n\n\n\n**#8 – Maintenance isn’t optional. It’s baked into the job.**\n\nRemember #5 from Part 1?  \n*“Automations are easy. Systems are not.”*\n\nExactly. If you’re serious about **systems**, not just stacking modules, you need to accept this:  \n**They evolve. Always.**\n\nYou can sell a setup for $5–10k that’s great.  \nBut don’t think your job ends after delivery.\n\nAPIs change.  \nClients switch tools.  \nWhatsApp updates.  \nThings break for no reason.  \nAnd you get the call.\n\nToday I jumped on a call for an automation I built 6 months ago.  \nThe client update his Whatsapp and something changed. It broke. I had no idea that could even happen. Didn’t matter. **Fix it.**\n\nEither you offer ongoing support (and charge for it), or you’ll be dragged back in anyway unpaid and unplanned.\n\nThat’s the cost of building something that actually matters.\n\n\n\n**#9 – Debugging fast is your most underrated skill.**\n\nStuff breaks.  \nClients want it fixed.  \n**Speed is everything.**\n\nAnd no, debugging isn’t just “being good at tools.”\n\nIt’s:\n\n1. Knowing *something* broke → alerts, logs, monitoring\n2. Knowing *what* broke → tracing the flow, reading error messages\n3. Knowing *how to fix it* → docs, forums, trial and error, late-night Googling\n\nNo one teaches you this on YouTube because it’s not sexy.  \nBut in the real world, this is what makes or breaks your rep.\n\n**The best builders?**  \nThey find the problem fast, communicate clearly, and solve it without drama.\n\n\n\n**#10 – Your system will suck (at first). And that’s okay.**\n\nHate to break it to you but your system *won’t* be perfect on v1.  \nEven simple ones.\n\nUsers behave in weird ways.  \nYou miss edge cases.  \nThings trigger unexpectedly.  \nClient adds a tool you didn’t know existed.\n\nAnd suddenly, you’re rewriting half the logic.\n\nThat’s not failure. That’s **reality**.\n\nA real system gets battle-tested and refined over time.  \nYou ship → observe → improve. That’s the game.\n\n**Best-case outcome:** It works great from day one.  \n**More likely outcome:** It breaks a bit, you stay available, you iterate.\n\nJust don’t ghost the client. A broken system and a silent dev?  \nThat’s the worst-case scenario.\n\n\n\n**Final thoughts:**\n\nAutomation is powerful.  \nBut don’t buy into the fantasy.\n\nYou’re not gonna become a millionaire after selling 3 flows.  \nYou *will* deal with bugs, messy data, changing APIs, and vague client requests.\n\nThis work is hard.  \nIt’s chaotic.  \nAnd it’s worth doing **if you do it right.**\n\n\n\nWhat other automation BS have you spotted out there?  ",
    "comments": 3,
    "analysis": "The user is addressing common misconceptions and harsh realities about automation work that YouTube gurus often overlook or understate, including issues like messy data, overhyped AI, necessary ongoing maintenance, the importance of fast debugging, and initial system imperfections. The post aims to share real-world experience and advice to set realistic expectations for automation professionals.",
    "sentiment": "sharing",
    "analysis_timestamp": "2025-08-02T22:40:47-0400"
  },
  {
    "id": "1mexk5z",
    "title": "Tried every “AI builds your workflow” tool. None worked. So we’re building our own. 100+ signups overnight",
    "url": "https://www.reddit.com/r/automation/comments/1mexk5z/tried_every_ai_builds_your_workflow_tool_none/",
    "author": "mfjrn",
    "subreddit": "automation",
    "created_utc": 1754057520.0,
    "description": "We’re two Dutch guys, both 24. Spent the last five years in marketing, using automation to handle repetitive tasks at the agency. Every time someone said “n8n can do that”, I knew what would happen next: I’d be the one building it. The real specialists knew exactly what needed automating, but the learning curve for n8n was too steep, so they passed it on.\n\nThe past few months I’ve tried every tool claiming to build workflows from text. Some give nice diagrams, some even work for a few steps… but most guess their way through, use outdated nodes, and break the moment you import them.\n\nSo we started building Centrato:\n- A chat with multiple agents that actually know n8n\n- Daily-updated node knowledge, no broken steps\n- Question cards that guide you through every choice\n- A validator that checks the flow before you export it\n\nLaunched the waitlist last night, woke up to 100+ signups. Beta’s opening soon – 30 days free, 150 prompts a day.\n\nIf you want to see a tool that fixes the guesswork, an upvote would help us reach more people building workflows ",
    "comments": 16,
    "analysis": "The user is addressing the shortcomings of existing AI tools that build workflows, which often produce inaccurate or broken automation steps. To solve this, they are developing a new tool called Centrato that offers reliable, up-to-date workflow automation with guided assistance and validation features. They also mention launching a waitlist with positive initial signups.",
    "sentiment": "sharing",
    "analysis_timestamp": "2025-08-02T22:40:49-0400"
  },
  {
    "id": "1ma4shb",
    "title": "Count of Finder windows using System Events stopped working lately",
    "url": "https://www.reddit.com/r/applescript/comments/1ma4shb/count_of_finder_windows_using_system_events/",
    "author": "JoRyCz",
    "subreddit": "applescript",
    "created_utc": 1753565172.0,
    "description": "Anyone knows why this stopped working (script is saved as **Application Bundle**) lately and if there is any workaround how to get count of Finder windows on **current desktop**?\n\n    tell application \"System Events\"\n      tell process \"Finder\"\n        set count_of_finder_windows to count of windows\n        display dialog count_of_finder_windows\n      end tell\n    end tell\n\nI tried every combination like save it under different name, add it to Accessibility by plus, drag &amp; drop, turn off, turn on, restarts between trials, tccutil reset All for this apple script bundle and start again, ... nothing worked. In the end I always end up with \"System Events got an error: asiTerm is not allowed assistive access. (**-25211**)\".\n\nI notice there is some new Automation menu where I found only System Event for this app bundle but there should be Finder also. I added some fake 'tell application \"Finder\" ...' and it appeared there but I got the same error.\n\nIssue is line 'set count\\_of\\_finder\\_windows to count of windows'",
    "comments": 2,
    "analysis": "```json\n{\n  \"analysis\": \"The user is trying to get the count of Finder windows on the current desktop using AppleScript via System Events, but recently receives an assistive access error (-25211), and their script no longer works despite multiple troubleshooting attempts.\",\n  \"sentiment\": \"need help\"\n}\n```",
    "sentiment": "",
    "analysis_timestamp": "2025-08-02T22:40:50-0400"
  }
]
